Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/hardware/stm32h72x73x_dmamux.h
/****************************************************************************
 * arch/arm/src/stm32h7/hardware/stm32h72x73x_dmamux.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H72X73X_DMAMUX_H
#define __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H72X73X_DMAMUX_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* DMAMUX1 mapping **********************************************************/

/* NOTE: DMAMUX1 channels 0 to 7 are connected to DMA1 channels 0 to 7.
 *       DMAMUX1 channels 8 to 15 are connected to DMA2 channels 0 to 7.
 */

#define DMAMUX1_REQ_GEN0       (1)
#define DMAMUX1_REQ_GEN1       (2)
#define DMAMUX1_REQ_GEN2       (3)
#define DMAMUX1_REQ_GEN3       (4)
#define DMAMUX1_REQ_GEN4       (5)
#define DMAMUX1_REQ_GEN5       (6)
#define DMAMUX1_REQ_GEN6       (7)
#define DMAMUX1_REQ_GEN7       (8)
#define DMAMUX1_ADC1           (9)
#define DMAMUX1_ADC2           (10)
#define DMAMUX1_TIM1_CH1       (11)
#define DMAMUX1_TIM1_CH2       (12)
#define DMAMUX1_TIM1_CH3       (13)
#define DMAMUX1_TIM1_CH4       (14)
#define DMAMUX1_TIM1_UP        (15)
#define DMAMUX1_TIM1_TRIG      (16)
#define DMAMUX1_TIM1_COM       (17)
#define DMAMUX1_TIM2_CH1       (18)
#define DMAMUX1_TIM2_CH2       (19)
#define DMAMUX1_TIM2_CH3       (20)
#define DMAMUX1_TIM2_CH4       (21)
#define DMAMUX1_TIM2_UP        (22)
#define DMAMUX1_TIM3_CH1       (23)
#define DMAMUX1_TIM3_CH2       (24)
#define DMAMUX1_TIM3_CH3       (25)
#define DMAMUX1_TIM3_CH4       (26)
#define DMAMUX1_TIM3_UP        (27)
#define DMAMUX1_TIM3_TRIG      (28)
#define DMAMUX1_TIM4_CH1       (29)
#define DMAMUX1_TIM4_CH2       (30)
#define DMAMUX1_TIM4_CH3       (31)
#define DMAMUX1_TIM4_UP        (32)
#define DMAMUX1_I2C1_RX        (33)
#define DMAMUX1_I2C1_TX        (34)
#define DMAMUX1_I2C2_RX        (35)
#define DMAMUX1_I2C2_TX        (36)
#define DMAMUX1_SPI1_RX        (37)
#define DMAMUX1_SPI1_TX        (38)
#define DMAMUX1_SPI2_RX        (39)
#define DMAMUX1_SPI2_TX        (40)
#define DMAMUX1_USART1_RX      (41)
#define DMAMUX1_USART1_TX      (42)
#define DMAMUX1_USART2_RX      (43)
#define DMAMUX1_USART2_TX      (44)
#define DMAMUX1_USART3_RX      (45)
#define DMAMUX1_USART3_TX      (46)
#define DMAMUX1_TIM8_CH1       (47)
#define DMAMUX1_TIM8_CH2       (48)
#define DMAMUX1_TIM8_CH3       (49)
#define DMAMUX1_TIM8_CH4       (50)
#define DMAMUX1_TIM8_UP        (51)
#define DMAMUX1_TIM8_TRIG      (52)
#define DMAMUX1_TIM8_COM       (53)
#define DMAMUX1_TIM5_CH1       (55)
#define DMAMUX1_TIM5_CH2       (56)
#define DMAMUX1_TIM5_CH3       (57)
#define DMAMUX1_TIM5_CH4       (58)
#define DMAMUX1_TIM5_UP        (59)
#define DMAMUX1_TIM5_TRIG      (60)
#define DMAMUX1_SPI3_RX        (61)
#define DMAMUX1_SPI3_TX        (62)
#define DMAMUX1_UART4_RX       (63)
#define DMAMUX1_UART4_TX       (64)
#define DMAMUX1_UART5_RX       (65)
#define DMAMUX1_UART5_TX       (66)
#define DMAMUX1_DAC_CH1        (67)
#define DMAMUX1_DAC_CH2        (68)
#define DMAMUX1_TIM6_UP        (69)
#define DMAMUX1_TIM7_UP        (70)
#define DMAMUX1_USART6_RX      (71)
#define DMAMUX1_USART6_TX      (72)
#define DMAMUX1_I2C3_RX        (73)
#define DMAMUX1_I2C3_TX        (74)
#define DMAMUX1_DCMI           (75)
#define DMAMUX1_CRYP_IN        (76)
#define DMAMUX1_CRYP_OUT       (77)
#define DMAMUX1_HASH_IN        (78)
#define DMAMUX1_UART7_RX       (79)
#define DMAMUX1_UART7_TX       (80)
#define DMAMUX1_UART8_RX       (81)
#define DMAMUX1_UART8_TX       (82)
#define DMAMUX1_SPI4_RX        (83)
#define DMAMUX1_SPI4_TX        (84)
#define DMAMUX1_SPI5_RX        (85)
#define DMAMUX1_SPI5_TX        (86)
#define DMAMUX1_SAI1A          (87)
#define DMAMUX1_SAI1B          (88)
#define DMAMUX1_SWPMI_RX       (91)
#define DMAMUX1_SWPMI_TX       (92)
#define DMAMUX1_SPDIFRX_DAT    (93)
#define DMAMUX1_SPDIFRX_CTRL   (94)
#define DMAMUX1_DFSDM1_DMA0    (101)
#define DMAMUX1_DFSDM1_DMA1    (102)
#define DMAMUX1_DFSDM1_DMA2    (103)
#define DMAMUX1_DFSDM1_DMA3    (104)
#define DMAMUX1_TIM15_CH1      (105)
#define DMAMUX1_TIM15_UP       (106)
#define DMAMUX1_TIM15_TRIG     (107)
#define DMAMUX1_TIM15_COM      (108)
#define DMAMUX1_TIM16_CH1      (109)
#define DMAMUX1_TIM16_UP       (110)
#define DMAMUX1_TIM17_CH1      (111)
#define DMAMUX1_TIM17_UP       (112)
#define DMAMUX1_ADC3           (115)
#define DMAMUX1_UART9_RX       (116)
#define DMAMUX1_UART9_TX       (117)
#define DMAMUX1_USART10_RX     (118)
#define DMAMUX1_USART10_TX     (119)
#define DMAMUX1_FMAC_RD        (120)
#define DMAMUX1_FMAC_WR        (121)
#define DMAMUX1_CORDIC_RD      (122)
#define DMAMUX1_CORDIC_WR      (123)
#define DMAMUX1_I2C5_RX        (124)
#define DMAMUX1_I2C5_TX        (125)
#define DMAMUX1_TIM23_CH1      (126)
#define DMAMUX1_TIM23_CH2      (127)
#define DMAMUX1_TIM23_CH3      (128)
#define DMAMUX1_TIM23_CH4      (129)
#define DMAMUX1_TIM23_UP       (130)
#define DMAMUX1_TIM23_TRIG     (131)
#define DMAMUX1_TIM24_CH1      (132)
#define DMAMUX1_TIM24_CH2      (133)
#define DMAMUX1_TIM24_CH3      (134)
#define DMAMUX1_TIM24_CH4      (135)
#define DMAMUX1_TIM24_UP       (136)
#define DMAMUX1_TIM24_TRIG     (137)

/* DMAMUX2 mapping **********************************************************/

/* NOTE: DMAMUX2 channels 0 to 7 are connected to BDMA channels 0 to 7 */

#define DMAMUX2_REQ_GEN0       (1)
#define DMAMUX2_REQ_GEN1       (2)
#define DMAMUX2_REQ_GEN2       (3)
#define DMAMUX2_REQ_GEN3       (4)
#define DMAMUX2_REQ_GEN4       (5)
#define DMAMUX2_REQ_GEN5       (6)
#define DMAMUX2_REQ_GEN6       (7)
#define DMAMUX2_REQ_GEN7       (8)
#define DMAMUX2_LPUART1_RX     (9)
#define DMAMUX2_LPUART1_TX     (10)
#define DMAMUX2_SPI6_RX        (11)
#define DMAMUX2_SPI6_TX        (12)
#define DMAMUX2_I2C4_RX        (13)
#define DMAMUX2_I2C4_TX        (14)
#define DMAMUX2_SAI4A          (15)
#define DMAMUX2_SAI4B          (16)
#define DMAMUX2_ADC3           (17)

/* DMAMAP for MDMA */

#define MDMA_STR_DMA1S0     0
#define MDMA_STR_DMA1S1     1
#define MDMA_STR_DMA1S2     2
#define MDMA_STR_DMA1S3     3
#define MDMA_STR_DMA1S4     4
#define MDMA_STR_DMA1S5     5
#define MDMA_STR_DMA1S6     6
#define MDMA_STR_DMA1S7     7
#define MDMA_STR_DMA2S0     8
#define MDMA_STR_DMA2S1     9
#define MDMA_STR_DMA2S2     10
#define MDMA_STR_DMA2S3     11
#define MDMA_STR_DMA2S4     12
#define MDMA_STR_DMA2S5     13
#define MDMA_STR_DMA2S6     14
#define MDMA_STR_DMA2S7     15
#define MDMA_STR_LTDC       16
#define MDMA_STR_OCTOSPI1_FT 22
#define MDMA_STR_OCTOSPI1_TC 23
#define MDMA_STR_DMA2D_CLUT 24
#define MDMA_STR_DMA2D_TC   25
#define MDMA_STR_DMA2D_TW   26
#define MDMA_STR_SDMMC1_ED  29
#define MDMA_STR_SDMMC1_EB  30
#define MDMA_STR_SDMMC1_EC  31
#define MDMA_STR_OCTOSPI2_FT 32
#define MDMA_STR_OCTOSPI2_TC 33

